#ifndef _SUDOKUCONSOLE_H_
#define _SUDOKUCONSOLE_H_

#include "Sudoku.h"
#include <iostream>
#include <conio.h>
#include <windows.h>
#include <tchar.h>

#define CONSOLE_SUDOKU_VERSION "v0.1"

#define CONSOLE_LINE_MAX 80
#define CONSOLE_ROW_MAX  24

#define SUDOKU_START_X 29
#define SUDOKU_START_Y 5
#define SUDOKU_END_X   49
#define SUDOKU_END_Y   15

#define KEY_UP    72
#define KEY_DOWN  80
#define KEY_LEFT  75
#define KEY_RIGHT 77

#define LEVEL_POS_X 43
#define LEVEL_POS_Y 18

class ConsoleSudoku
{
private:
    //数独对象
    HANDLE m_hStdOut;
public:

    //游戏等级
    enum SudokuLevel
    {
        Level0 = 0,
        Level1 = 30,
        Level2 = 35,
        Level3 = 40,
        Level4 = 45,
        Level5 = 50,
        Level6 = 55,
    };

    //上一次填写的位置
    COORD m_lastCoord;
    //上一次填写的数字
    signed char m_lastNum;

    //数独对象
    Sudoku m_sudoku;
private:
    /************************************************************************
    * 功能 : 重置。
    * 参数 : 
    *        resetChar -> 当前键入的字符(判断是否是'r')。
    * 返回 : 键入的字符是'r'并重置返回true，否则返回false。
    ************************************************************************/
    bool Reset(signed char resetChar);
    /************************************************************************
    * 功能 : 撤销。
    * 参数 :
    *        undoChar -> 当前键入的字符(判断是否是'u')。
    * 返回 : 键入的字符是'u'则返回上一次输入前的字符，否则还是此次输入的字符。
    * 备注 : 函数会将光标移动到上依次输入的位置。
    ************************************************************************/
    signed char Undo(signed char undoChar);
    /************************************************************************
    * 功能 : 输入数字。
    * 参数 :
    *        numChar -> 当前键入的字符(判断是否是'0'-'9')。
    * 返回 : 键入的字符是'0'-'9'返回true，否则返回false。
    ************************************************************************/
    bool InputNumber(signed char numChar);
    /************************************************************************
    * 功能 : 移动光标。
    * 参数 :
    *        directionChar -> 当前键入的字符(判断是否是定义的方向键)。
    * 返回 : 键入的字符是定义的方向键返回true，否则返回false。
    ************************************************************************/
    bool MoveCursor(signed char directionChar);
    /************************************************************************
    * 功能 : 显示初始界面。
    * 参数 : 无。
    * 返回 : 无。
    ************************************************************************/
    void Show();
    /************************************************************************
    * 功能 : 新建数独。
    * 参数 :
    *        level -> 游戏等级。
    * 返回 : 无。
    ************************************************************************/
    void New(SudokuLevel);
    /************************************************************************
    * 功能 : 新建游戏。
    * 参数 :
    *        newChar -> 当前键入的字符(判断是否是'n')。
    * 返回 : 键入的字符是'n'并随后输入正确的等级返回对应等级。
    ************************************************************************/
    SudokuLevel NewGame(signed char newChar);
public:
    /************************************************************************
    * 功能 : 默认构造。
    * 参数 : 无。
    * 返回 : 无。
    ************************************************************************/
    ConsoleSudoku();
    /************************************************************************
    * 功能 : 运行。
    * 参数 : 无。
    * 返回 : 无。
    ************************************************************************/
    void Run();
};
#endif // _SUDOKUCONSOLE_H_

